tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1508_tdd.h
#define LC4G2D2N                      1091
#define CLC4GLS1_D2N                  1092
#define LC4G2D2T                      1093
#define CLC4GLS1_D2T                  1094
#define CLC4GLS1_D3N                  1095
#define LC4G2D3N                      1096
#define LC4G2D3T                      1097
#define CLC4GLS1_D3T                  1098
#define CLC4GLS1_D4N                  1099
#define LC4G2D4N                      1100
#define CLC4GLS1_D4T                  1101
#define LC4G2D4T                      1102
#define CLC4GLS2                      1103
#define CLC4GLS2_D1N                  1104
#define LC4G3D1N                      1105
#define CLC4GLS2_D1T                  1106
#define LC4G3D1T                      1107
#define LC4G3D2N                      1108
#define CLC4GLS2_D2N                  1109
#define LC4G3D2T                      1110
#define CLC4GLS2_D2T                  1111
#define CLC4GLS2_D3N                  1112
#define LC4G3D3N                      1113
#define CLC4GLS2_D3T                  1114
#define LC4G3D3T                      1115
#define LC4G3D4N                      1116
#define CLC4GLS2_D4N                  1117
#define LC4G3D4T                      1118
#define CLC4GLS2_D4T                  1119
#define CLC4GLS3                      1120
#define CLC4GLS3_G4D1N                1121
#define LC4G4D1N                      1122
#define LC4G4D1T                      1123
#define CLC4GLS3_G4D1T                1124
#define LC4G4D2N                      1125
#define CLC4GLS3_G4D2N                1126
#define LC4G4D2T                      1127
#define CLC4GLS3_G4D2T                1128
#define CLC4GLS3_G4D3N                1129
#define LC4G4D3N                      1130
#define CLC4GLS3_G4D3T                1131
#define LC4G4D3T                      1132
#define LC4G4D4N                      1133
#define CLC4GLS3_G4D4N                1134
#define LC4G4D4T                      1135
#define CLC4GLS3_G4D4T                1136
#define ICDIO                         1137
#define TRIS_ICDCLK                   1138
#define TRIS_ICDDAT                   1139
#define LAT_ICDCLK                    1140
#define LAT_ICDDAT                    1141
#define PORT_ICDCLK                   1142
#define PORT_ICDDAT                   1143
#define ICDCON0                       1144
#define RSTVEC                        1145
#define DBGINEX                       1146
#define SSTEP                         1147
#define FREEZ                         1148
#define INBUG                         1149
#define ICDSTAT                       1150
#define USRHLTF                       1151
#define TRP0HLTF                      1152
#define TRP1HLTF                      1153
#define DEVSEL                        1154
#define DEVSEL0                       1155
#define DEVSEL1                       1156
#define DEVSEL2                       1157
#define ICDINSTL                      1158
#define DBGIN0                        1159
#define DBGIN1                        1160
#define DBGIN2                        1161
#define DBGIN3                        1162
#define DBGIN4                        1163
#define DBGIN5                        1164
#define DBGIN6                        1165
#define DBGIN7                        1166
#define ICDINSTH                      1167
#define DBGIN8                        1168
#define DBGIN9                        1169
#define DBGIN10                       1170
#define DBGIN11                       1171
#define DBGIN12                       1172
#define DBGIN13                       1173
#define ICDBK0CON                     1174
#define BKHLT                         1175
#define BKEN                          1176
#define ICDBK0L                       1177
#define BKA0                          1178
#define BKA1                          1179
#define BKA2                          1180
#define BKA3                          1181
#define BKA4                          1182
#define BKA5                          1183
#define BKA6                          1184
#define BKA7                          1185
#define ICDBK0H                       1186
#define BKA8                          1187
#define BKA9                          1188
#define BKA10                         1189
#define BKA11                         1190
#define BKA12                         1191
#define BKA13                         1192
#define BKA14                         1193
#define BSRICDSHAD                    1194
#define BSR_ICDSHAD                   1195
#define STATUS_SHAD                   1196
#define C_SHAD                        1197
#define DC_SHAD                       1198
#define Z_SHAD                        1199
#define WREG_SHAD                     1200
#define BSR_SHAD                      1201
#define PCLATH_SHAD                   1202
#define FSR0L_SHAD                    1203
#define FSR0H_SHAD                    1204
#define FSR1L_SHAD                    1205
#define FSR1H_SHAD                    1206
#define STKPTR                        1207
#define TOSL                          1208
#define TOSH                          1209

#endif // _PIC16F1508_H_
